Switch>en
Switch>enable 
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#en
Switch(config)#ena
Switch(config)#enable se
Switch(config)#enable secret 123
Switch(config)#ex
Switch(config)#exit 
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#dis
Switch#dis
% Ambiguous command: "dis"
Switch#disa
Switch#disable 
Switch>en
Switch>enable 
Password: 
Switch#conf t
Switch#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip ar
Switch(config)#ip adr
Switch(config)#ip add
Switch(config)#ip add 11.0.0.3 255.255.0.0
                   ^
% Invalid input detected at '^' marker.
	
Switch(config)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int vl
Switch(config)#int vlan1
Switch(config-if)#ip adr
Switch(config-if)#ip addr
Switch(config-if)#ip address 11.0.0.3 255.255.0.0
Switch(config-if)#no sh
Switch(config-if)#no shutdown 

Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

Switch(config-if)#ex
Switch(config-if)#exit 
Switch(config)#li
Switch(config)#line vty 0 4
Switch(config-line)#pass
Switch(config-line)#password 123
Switch(config-line)#ex
Switch(config-line)#exi
Switch(config-line)#exit 
Switch(config)#copy run
Switch(config)#copy runn
Switch(config)#copy running c
Switch(config)#ex
Switch(config)#exit 
Switch#
%SYS-5-CONFIG_I: Configured from console by console
copy ru
Switch#copy running-config st
Switch#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#
Switch#